In [42]:
import pandas as pd 
df = pd.read_csv("Titanic.csv")
df.head()

,0,1,2,3,4
0,Name,PClass,Age,Sex,Survived
1,"Allison, Miss Helen Loraine",1,2,female,0
2,"Allison, Mr Hudson Joshua Creighton",1,30,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1,25,female,0
4,"Allison, Master Hudson Trevor",1,0.92,male,1

In [38]:
df.drop(['Name'],axis=1,inplace=True)
df.head()

   PClass    Age     Sex  Survived
0     1.0  29.00  female         1
1     1.0   2.00  female         0
2     1.0  30.00    male         0
3     1.0  25.00  female         0
4     1.0   0.92    male         1

In [19]:
target= df.Survived
inputs=df.drop('Survived',axis='columns')

In [20]:
# dummies convert sex column into two colums male and female
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       1     0
1       1     0
2       0     1
3       1     0
4       0     1

In [21]:
# append dummy columns into input dataframe
input = pd.concat([inputs,dummies],axis='columns')
input.head()

   PClass    Age     Sex  female  male
0     1.0  29.00  female       1     0
1     1.0   2.00  female       1     0
2     1.0  30.00    male       0     1
3     1.0  25.00  female       1     0
4     1.0   0.92    male       0     1

In [22]:
input.drop('Sex',axis='columns',inplace=True)
input.head()

   PClass    Age  female  male
0     1.0  29.00       1     0
1     1.0   2.00       1     0
2     1.0  30.00       0     1
3     1.0  25.00       1     0
4     1.0   0.92       0     1

In [16]:
input.Age[:20]

0     29.00
1      2.00
2     30.00
3     25.00
4      0.92
5     47.00
6     63.00
7     39.00
8     58.00
9     71.00
10    47.00
11    19.00
12      NaN
13      NaN
14      NaN
15    50.00
16    24.00
17    36.00
18    37.00
19    47.00
Name: Age, dtype: float64

In [32]:
input.Age = input.Age.fillna(input.Age.mean())
input

      PClass    Age  female  male
0        1.0  29.00       1     0
1        1.0   2.00       1     0
2        1.0  30.00       0     1
3        1.0  25.00       1     0
4        1.0   0.92       0     1
...      ...    ...     ...   ...
1308     3.0  27.00       0     1
1309     3.0  26.00       0     1
1310     3.0  22.00       0     1
1311     3.0  24.00       0     1
1312     3.0  29.00       0     1

[1313 rows x 4 columns]

In [39]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [26]:
len(X_train)

1050

In [27]:
len(X_test)

263

In [28]:
len(inputs)

1313

In [40]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [ ]:
model.fit(X_train,y_train)

In [ ]:
model.score(X_test,y_test)

In [ ]:
X_test[:10]

In [ ]:
model.predict(X_test[:10])

In [ ]:
model.predict_proba(X_test[:10])